In [19]:
import pandas as pd
from IPython.display import VimeoVideo

# Open all files

The first part of any data science project is preparing your data, which means making sure its in the right place and format for you to conduct your analysis. The first step of any data preparation is importing your raw data and cleaning it. 

If you look this directory, you'll see that the data for this project comes in three txt files: `mexico-real-estate-1.csv`, `mexico-real-estate-2.csv`, and `mexico-real-estate-3.csv`.

### Step 1: Read these three txt files into three separate DataFrames named `df1`, `df2`, and `df3`, respectively.

In [57]:
df1 = pd.read_csv("mexico-real-estate-1.txt", delimiter=",")
df2 = pd.read_csv("mexico-real-estate-2.txt", delimiter=",")
df3 = pd.read_csv("mexico-real-estate-3.txt", delimiter=",")

**Print object type and shape for DataFrames**

In [ ]:
print("df1 type:", type(df1))
print("df1 shape:", df1.shape)
print()
print("df2 type:", type(df2))
print("df2 shape:", df2.shape)
print()
print("df3 type:", type(df3))
print("df3 shape:", df3.shape)

**Check the first 10 records of all dataframes**

In [ ]:
df1.head()

In [ ]:
df2.head()

In [ ]:
df3.head()

 ## Step 2: Clean all dataframes

 #### 2.1: Clean df1

Now we have three DataFrames, it's time to inspect them to see if they need any cleaning. 
Let's look at them one-by-one. we can do this by inspect df1, df2 and df3 by looking at its shape attribute. Then we use the info method to see the data types and number of missing values for each column. Finally, we use the head method to determine to look at the first five rows of your dataset.

In [ ]:
# Print df1 shape
print("First dataframe shape(df1-shape): ", df1.shape)
# Print df1 info
print("First dataframe info(df1-info): ", df1.info)
# Get output of df1 head
print("First dataframe head(df1-head): ", df1.head())

It looks like there are a couple of problems in this DataFrame that we need to solve. First, there are many rows with NaN values in the "lat" and "lon" columns. Second, the data type for the "price_usd" column is object when it should be float. so, we clean df1 by dropping rows with NaN values. Then remove the "$" and "," characters from "price_usd" and recast the values in the column as floats.

In [21]:
# Drop null values from df1 set inplace to True
df1.dropna(inplace=True)
# Clean "price_usd" column in df1 by removing the dollar sign from the beginning.
# this can be done by replacing $ with ""
df1["price_usd"] = df1["price_usd"].str.replace('$', "", regex=False)

# Print object type, shape, and head
print("df1 type:", type(df1))
print("df1 shape:", df1.shape)
df1.head()

df1 type: <class 'pandas.core.frame.DataFrame'>
df1 shape: (583, 6)

  property_type             state        lat         lon  area_m2   price_usd
0         house  Estado de México  19.560181  -99.233528    150.0   67,965.56
1         house        Nuevo León  25.688436 -100.198807    186.0   63,223.78
2     apartment          Guerrero  16.767704  -99.764383     82.0   84,298.37
3     apartment          Guerrero  16.829782  -99.911012    150.0   94,308.80
5         house           Yucatán  21.052583  -89.538639    205.0  105,191.37

Excellent. Now we have removed the missing values(NaN) and the '$' sign from "price_usd" column. next we remove ',' from "price_usd" column

In [23]:
# Clean "price_usd" column in df1 by removing the ',' sign.
# this can be done by replacing ',' with ""
df1["price_usd"] = df1["price_usd"].str.replace(',', "", regex=False)
# Print object type, shape, and head
print("df1 type:", type(df1))
print("df1 shape:", df1.shape)
df1.head()

Boom, df1 ready
Next clean df2

 #### 2.2: Clean df2

Now it's time to tackle df2. Let's inspect it using the same commands we used before. we'll notice that it has the same issue of NaN values, but there's a new problem, too: The home prices are in Mexican pesos ("price_mxn"), not US dollars ("price_usd"). If we want to compare all the home prices in this dataset, they all need to be in the same currency.

In [ ]:
# Print df2 shape
print("Second dataframe shape(df2-shape): ", df2.shape)
# Print df2 info
print("Second dataframe info(df2-info): ", df2.info)
# Get output of df2 head
print("Second dataframe head(df2-head): ", df2.head())

In [28]:
print( df2.head())

  property_type       state        lat         lon  area_m2  price_mxn
0     apartment  Nuevo León  25.721081 -100.345581     72.0  1300000.0
1     apartment      Puebla        NaN         NaN    190.0  2500000.0
2         house     Morelos  23.634501 -102.552788    360.0  5300000.0
3         house     Morelos        NaN         NaN     76.0   820000.0
4         house      Puebla        NaN         NaN    200.0  1100000.0

First, drop rows with NaN values in df2. Next, we use the "price_mxn" column to create a new column named "price_usd". 
(Keep in mind that, when this data was collected in 2014, a dollar cost 19 pesos.) Finally, drop the "price_mxn" from the DataFrame.

In [ ]:
# Drop null values from df2
df1.dropna(inplace=True)
# Create "price_usd" column for df2 (19 pesos to the dollar in 2014)
df2["price_usd"] = (df2["price_mxn"]/19).head()
# Now "price_mxn" column is not necessary more so drop "price_mxn" column from df2
df2.drop(columns=["price_mxn"], inplace=True)

# Print object type, shape, and head
print("df2 type:", type(df2))
print("df2 shape:", df2.shape)
df2.head()

NB: From the above cell, once we execute the cell, we may face the error, 
---------------------------------------------------------------------------

KeyError                                  Traceback (most recent call last)
File ~\AppData\Local\Programs\Python\Python312\Lib\site-packages\pandas\core\indexes\base.py:3805, in Index.get_loc(self, key)
   3804 try:
-> 3805     return self._engine.get_loc(casted_key)
   3806 except KeyError as err:

File index.pyx:167, in pandas._libs.index.IndexEngine.get_loc()

File index.pyx:196, in pandas._libs.index.IndexEngine.get_loc()

File pandas\\_libs\\hashtable_class_helper.pxi:7081, in pandas._libs.hashtable.PyObjectHashTable.get_item()

File pandas\\_libs\\hashtable_class_helper.pxi:7089, in pandas._libs.hashtable.PyObjectHashTable.get_item()

KeyError: 'price_mxn'

The above exception was the direct cause of the following exception:

KeyError                                  Traceback (most recent call last)
Cell In[34], line 4
      2 df1.dropna(inplace=True)
      3 # Create "price_usd" column for df2 (19 pesos to the dollar in 2014)
----> 4 df2["price_usd"] = (df2["price_mxn"]/19).head()
      5 # Now "price_mxn" column is not necessary more so drop "price_mxn" column from df2
      6 df2.drop(columns=["price_mxn"], inplace=True)

File ~\AppData\Local\Programs\Python\Python312\Lib\site-packages\pandas\core\frame.py:4102, in DataFrame.__getitem__(self, key)
   4100 if self.columns.nlevels > 1:
   4101     return self._getitem_multilevel(key)
-> 4102 indexer = self.columns.get_loc(key)
   4103 if is_integer(indexer):
   4104     indexer = [indexer]

File ~\AppData\Local\Programs\Python\Python312\Lib\site-packages\pandas\core\indexes\base.py:3812, in Index.get_loc(self, key)
   3807     if isinstance(casted_key, slice) or (
   3808         isinstance(casted_key, abc.Iterable)
   3809         and any(isinstance(x, slice) for x in casted_key)
   3810     ):
   3811         raise InvalidIndexError(key)
-> 3812     raise KeyError(key) from err
   3813 except TypeError:
   3814     # If we have a listlike key, _check_indexing_error will raise
   3815     #  InvalidIndexError. Otherwise we fall through and re-raise
   3816     #  the TypeError.
   3817     self._check_indexing_error(key)

KeyError: 'price_mxn'

This happened because we have already removed the column "price_mxn" in the first execusion.

Booooooom, df2 is ready for the next processing

 #### 2.3: Clean df3

Great work! We're now on the final DataFrame. Use the same shape, info and head commands to inspect the df3. Do you see any familiar issues?

We'll notice that we still have NaN values, but there are two new problems:
   1. Instead of separate `"lat"` and `"lon"` columns, there's a single `"lat-lon"` column.(Should be splitted into two columns)
   2. Instead of a `"state"` column, there's a `"place_with_parent_names"` column.
We need the resolve these problems so that df3 has the same columns in the same format as df1 and df2.

Let's move on

Drop rows with `NaN` values in `df3`. Then use the [`split`](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.split.html) method to create two new columns from `"lat-lon"` named `"lat"` and `"lon"`, respectively.

- Drop rows with missing values from a DataFrame using pandas.
- Split the strings in one column to create another using pandas.
- Rename the "place_with_parent_names" column to "state"
- Drop "lat-lon" column. Because it is not necessary more

In [44]:
df1.head()

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528    150.0   67965.56
1         house        Nuevo León  25.688436 -100.198807    186.0   63223.78
2     apartment          Guerrero  16.767704  -99.764383     82.0   84298.37
3     apartment          Guerrero  16.829782  -99.911012    150.0   94308.80
5         house           Yucatán  21.052583  -89.538639    205.0  105191.37

In [ ]:
# Drop null values from df3
df3.dropna()
# Create "lat" and "lon" columns for df3
df3[["lat", "lon"]] = df3["lat-lon"].str.split(',', expand=True)
#Extract the "state" from  "place_with_parent_names" column and create new "state" column.
#state is the third index after splitting  "place_with_parent_names" column
df3["state"] = df3["place_with_parent_names"].str.split("|", expand=True)[2]
# Drop "lat-lon" coumn
df3.drop(columns=["lat-lon"], inplace=True)
# Drop "place_with_parent_names" coumn
df3.drop(columns=["place_with_parent_names"], inplace=True)
# Print object type, shape, and head
print("df3 type:", type(df3))
print("df3 shape:", df3.shape)
df3.head()

***wuhuuuuuuuuuu***, completed cleaning all dataframes, now lets combine them together

## Step 3: Concatenate DataFrames

Great work! we have three clean DataFrames, and now it's time to combine them into a single DataFrame so that we can conduct our analysis.

Use pd.concat to concatenate df1, df2, df3 as new DataFrame named df. Our new DataFrame should have 1,736 rows and 6 columns:"property_type", "state", "lat", "lon", "area_m2", and "price_usd".

In [50]:
# Concatenate df1, df2, and df3
df = pd.concat([df1, df2, df3])

# Print object type, shape, and head
print("df type:", type(df))
print("df shape:", df.shape)
df.head()

df type: <class 'pandas.core.frame.DataFrame'>
df shape: (1983, 6)

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528    150.0   67965.56
1         house        Nuevo León  25.688436 -100.198807    186.0   63223.78
2     apartment          Guerrero  16.767704  -99.764383     82.0   84298.37
3     apartment          Guerrero  16.829782  -99.911012    150.0   94308.80
5         house           Yucatán  21.052583  -89.538639    205.0  105191.37

## Step 4: Save df¶

Save df as a CSV file using the to_csv method with name "mexico-real-estate-clean.csv". Be sure to set the index argument to False.

In [52]:
df.to_csv( "mexico-real-estate-clean.csv")

**Check**

Use the python os module to check if the file is already created in this directory.

In [ ]:
#import os module
import os
##loop through all files and dir in this dir
for file in os.listdir():
    print(file)

### Great and amazing.  🎯 Now our dataframe is ready and we are also ready to proceed. next we will do more exploratory data analysis.
### See you next